{"name":"Falius The Wise","classData":{"name":"Wizard","misc":{},"url":"https://roll20.net/compendium/dnd5e/Wizard","start_prof":{"wpn":["Light Crossbow","Dagger","Dart","Quarterstaff","Sling"],"tool":[],"armr":[]},"spcMod":"int","save_throws":["int","wis"],"hitdie":"d6"},"lvl":10,"statsData":{"prof":4,"save_throws":["int","wis"],"marks":["arcana","history","insight","perception"],"expert":[],"ability":{"str":9,"dex":10,"cnst":15,"int":20,"wis":16,"chr":10},"inspiration":"d12","misc_prof":{"lang":["Common","Draconic","Elvish","Orc"],"wpn":["Light Crossbow","Dagger","Dart","Quarterstaff","Sling"],"tool":["Dragonchess"],"armr":[]},"ability_mod":{"str":-1,"dex":0,"cnst":2,"int":5,"wis":3,"chr":0},"skills":{"acrobatics":0,"animal_handling":3,"arcana":9,"athletics":-1,"deception":0,"history":9,"insight":7,"intimidation":0,"investigation":5,"medicine":3,"nature":5,"perception":7,"performance":0,"persuasion":0,"religon":5,"sleight_of_hand":0,"stealth":0,"survival":3},"passive_perception":17},"healthData":{"maxHP":74,"currentHP":74,"defaultAC":10,"currentAC":10,"hitdie":"10d6"},"exp":14000,"magicData":{"spells":{"Light":{"name":"Light","level":"Cantrip","ctime":"1 Action","ritual":"no","concentration":"no","school":"Evocation","description":"You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.\n\nIf you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell.","components":"V, M *","duration":"1 Hour","range":"Touch (20 ft *)","roll":null,"url":"https://www.dndbeyond.com/spells/light"},"Prestidigitation":{"name":"Prestidigitation","level":"Cantrip","ctime":"1 Action","ritual":"no","concentration":"no","school":"Transmutation","description":"This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range:If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.","components":"V, S","duration":"1 Hour","range":"10 ft","roll":null,"url":"https://www.dndbeyond.com/spells/prestidigitation"},"Minor Illusion":{"name":"Minor Illusion","level":"Cantrip","ctime":"1 Action","ritual":"no","concentration":"no","school":"Illusion","description":"You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.\n\nIf you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\nIf you create an image of an object--such as a chair, muddy footprints, or a small chest--it must be no larger than a 5-foot cube. The image can't create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.\n\nIf a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.","components":"S, M *","duration":"1 Minute","range":"30 ft (5 ft *)","roll":null,"url":"https://www.dndbeyond.com/spells/minor-illusion"},"Message":{"name":"Message","level":"Cantrip","ctime":"1 Action","ritual":"no","concentration":"no","school":"Transmutation","description":"You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear.\n\nYou can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the spell. The spell doesn't have to follow a straight line and can travel freely around corners or through openings.","components":"V, S, M *","duration":"1 Round","range":"120 ft","roll":null,"url":"https://www.dndbeyond.com/spells/message"},"Fire Bolt":{"name":"Fire Bolt","level":"Cantrip","ctime":"1 Action","ritual":"no","concentration":"no","school":"Evocation","description":"You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried.\n\nThis spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).","components":"V, S","duration":"Instantaneous","range":"120 ft","roll":"1d10","url":"https://www.dndbeyond.com/spells/fire-bolt"},"Unseen Servant":{"name":"Unseen Servant","level":"1st","ctime":"1 Action","ritual":"no","concentration":"no","school":"Conjuration","description":"This spell creates an invisible, mindless, shapeless, Medium force that performs simple tasks at your command until the spell ends. The servant springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 hit point, and a Strength of 2, and it can't attack. If it drops to 0 hit points, the spell ends.\n\nOnce on each of your turns as a bonus action, you can mentally command the servant to move up to 15 feet and interact with an object. The servant can perform simple tasks that a human servant could do, such as fetching things, cleaning, mending, folding clothes, lighting fires, serving food, and pouring wine. Once you give the command, the servant performs the task to the best of its ability until it completes the task, then waits for your next command.\n\nIf you command the servant to perform a task that would move it more than 60 feet away from you, the spell ends.","components":"V, S, M *","duration":"1 Hour","range":"60 ft","roll":null,"url":"https://www.dndbeyond.com/spells/unseen-servant"},"Shield":{"name":"Shield","level":"1st","ctime":"1 Reaction *","ritual":"no","concentration":"no","school":"Abjuration","description":"An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.","components":"V, S","duration":"1 Round","range":"Self","roll":null,"url":"https://www.dndbeyond.com/spells/shield"},"Detect Magic":{"name":"Detect Magic","level":"1st","ctime":"1 Action","ritual":"no","concentration":"no","school":"Divination","description":"For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.\n\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","components":"V, S","duration":"Concentration 10 Minutes","range":"Self (30 ft)","roll":null,"url":"https://www.dndbeyond.com/spells/detect-magic"},"Magic Missile":{"name":"Magic Missile","level":"1st","ctime":"1 Action","ritual":"no","concentration":"no","school":"Evocation","description":"You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st.","components":"V, S","duration":"Instantaneous","range":"120 ft","roll":"1d4","url":"https://www.dndbeyond.com/spells/magic-missile"},"Grease":{"name":"Grease","level":"1st","ctime":"1 Action","ritual":"no","concentration":"no","school":"Conjuration","description":"Slick grease covers the ground in a 10-foot square centered on a point within range and turns it into difficult terrain for the duration.\n\nWhen the grease appears, each creature standing in its area must succeed on a Dexterity saving throw or fall prone. A creature that enters the area or ends its turn there must also succeed on a Dexterity saving throw or fall prone.","components":"V, S, M *","duration":"1 Minute","range":"60 ft (10 ft)","roll":null,"url":"https://www.dndbeyond.com/spells/grease"},"Mage Armor":{"name":"Mage Armor","level":"1st","ctime":"1 Action","ritual":"no","concentration":"no","school":"Abjuration","description":"You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.","components":"V, S, M *","duration":"8 Hours","range":"Touch","roll":null,"url":"https://www.dndbeyond.com/spells/mage-armor"},"Identify":{"name":"Identify","level":"1st","ctime":"1 Minute","ritual":"no","concentration":"no","school":"Divination","description":"You choose one object that you must touch throughout the casting of the spell. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any spells are affecting the item and what they are. If the item was created by a spell, you learn which spell created it.\n\nIf you instead touch a creature throughout the casting, you learn what spells, if any, are currently affecting it.","components":"V, S, M *","duration":"Instantaneous","range":"Touch","roll":null,"url":"https://www.dndbeyond.com/spells/identify"},"Shatter":{"name":"Shatter","level":"2nd","ctime":"1 Action","ritual":"no","concentration":"no","school":"Evocation","description":"A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw.\n\nA nonmagical object that isn't being worn or carried also takes the damage if it's in the spell's area.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.","components":"V, S, M *","duration":"Instantaneous","range":"60 ft (10 ft)","roll":"3d8","url":"https://www.dndbeyond.com/spells/shatter"},"Pyrotechnics":{"name":"Pyrotechnics","level":"2nd","ctime":"1 Action","ritual":"no","concentration":"no","school":"Transmutation","description":"Choose an area of nonmagical flame that you can see and that fits within a 5-foot cube within range. You can extinguish the fire in that area, and you create either fireworks or smoke when you do so.\n\nFireworks. The target explodes with a dazzling display of colors. Each creature within 10 feet of the target must succeed on a Constitution saving throw or become blinded until the end of your next turn.\n\nSmoke. Thick black smoke spreads out from the target in a 20-foot radius, moving around corners. The area of the smoke is heavily obscured. The smoke persists for 1 minute or until a strong wind disperses it.","components":"V, S","duration":"Instantaneous","range":"60 ft (5 ft *)","roll":null,"url":"https://www.dndbeyond.com/spells/pyrotechnics"},"Misty Step":{"name":"Misty Step","level":"2nd","ctime":"1 Bonus Action","ritual":"no","concentration":"no","school":"Conjuration","description":"Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.","components":"V","duration":"Instantaneous","range":"Self","roll":null,"url":"https://www.dndbeyond.com/spells/misty-step"},"Flaming Sphere":{"name":"Flaming Sphere","level":"2nd","ctime":"1 Action","ritual":"no","concentration":"no","school":"Conjuration","description":"A 5-foot-diameter sphere of fire appears in an unoccupied space of your choice within range and lasts for the duration. Any creature that ends its turn within 5 feet of the sphere must make a Dexterity saving throw. The creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.\n\nAs a bonus action, you can move the sphere up to 30 feet. If you ram the sphere into a creature, that creature must make the saving throw against the sphere's damage, and the sphere stops moving this turn.\n\nWhen you move the sphere, you can direct it over barriers up to 5 feet tall and jump it across pits up to 10 feet wide. The sphere ignites flammable objects not being worn or carried, and it sheds bright light in a 20-foot radius and dim light for an additional 20 feet.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.","components":"V, S, M *","duration":"Concentration 1 Minute","range":"60 ft (5 ft)","roll":"2d6","url":"https://www.dndbeyond.com/spells/flaming-sphere"},"Levitate":{"name":"Levitate","level":"2nd","ctime":"1 Action","ritual":"no","concentration":"no","school":"Transmutation","description":"One creature or loose object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. An unwilling creature that succeeds on a Constitution saving throw is unaffected.\n\nThe target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target's altitude by up to 20 feet in either direction on your turn. If you are the target, you can move up or down as part of your move. Otherwise, you can use your action to move the target, which must remain within the spell's range.\n\nWhen the spell ends, the target floats gently to the ground if it is still aloft.","components":"V, S, M *","duration":"Concentration 10 Minutes","range":"60 ft","roll":null,"url":"https://www.dndbeyond.com/spells/levitate"},"Scorching Ray":{"name":"Scorching Ray","level":"2nd","ctime":"1 Action","ritual":"no","concentration":"no","school":"Evocation","description":"You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several.\n\nMake a ranged spell attack for each ray. On a hit, the target takes 2d6 fire damage.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you create one additional ray for each slot level above 2nd.","components":"V, S","duration":"Instantaneous","range":"120 ft","roll":"2d6","url":"https://www.dndbeyond.com/spells/scorching-ray"},"Remove Curse":{"name":"Remove Curse","level":"3rd","ctime":"1 Action","ritual":"no","concentration":"no","school":"Abjuration","description":"At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded.","components":"V, S","duration":"Instantaneous","range":"Touch","roll":null,"url":"https://www.dndbeyond.com/spells/remove-curse"},"Fireball":{"name":"Fireball","level":"3rd","ctime":"1 Action","ritual":"no","concentration":"no","school":"Evocation","description":"A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.\n\nThe fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried.\n\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.","components":"V, S, M *","duration":"Instantaneous","range":"150 ft (20 ft)","roll":"8d6","url":"https://www.dndbeyond.com/spells/fireball"},"Counterspell":{"name":"Counterspell","level":"3rd","ctime":"1 Reaction *","ritual":"no","concentration":"no","school":"Abjuration","description":"You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a success, the creature's spell fails and has no effect.\n\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.","components":"S","duration":"Instantaneous","range":"60 ft","roll":null,"url":"https://www.dndbeyond.com/spells/counterspell"},"Fly":{"name":"Fly","level":"3rd","ctime":"1 Action","ritual":"no","concentration":"no","school":"Transmutation","description":"You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.\n\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.","components":"V, S, M *","duration":"Concentration 10 Minutes","range":"Touch","roll":null,"url":"https://www.dndbeyond.com/spells/fly"},"Tiny Hut":{"name":"Tiny Hut","level":"3rd","ctime":"1 Minute","ritual":"no","concentration":"no","school":"Evocation","description":"A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area.\n\nNine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures. Creatures and objects within the dome when you cast this spell can move through it freely. All other creatures and objects are barred from passing through it. Spells and other magical effects can't extend through the dome or be cast through it. The atmosphere inside the space is comfortable and dry, regardless of the weather outside.\n\nUntil the spell ends, you can command the interior to become dimly lit or dark. The dome is opaque from the outside, of any color you choose, but it is transparent from the inside.","components":"V, S, M *","duration":"8 Hours","range":"Self (10 ft)","roll":null,"url":"https://www.dndbeyond.com/spells/tiny-hut"},"Watery Sphere":{"name":"Watery Sphere","level":"4th","ctime":"1 Action","ritual":"no","concentration":"no","school":"Conjuration","description":"You conjure up a sphere of water with a 5-foot radius at a point you can see within range. The sphere can hover but no more than 10 feet off the ground. The sphere remains for the spell’s duration.\n\nAny creature in the sphere’s space must make a Strength saving throw. On a successful save, a creature is ejected from that space to the nearest unoccupied space of the creature’s choice outside the sphere. A Huge or larger creature succeeds on the saving throw automatically, and a Large or smaller creature can choose to fail it. On a failed save, a creature is restrained by the sphere and is engulfed by the water. At the end of each of its turns, a restrained target can repeat the saving throw, ending the effect on itself on a success.\n\nThe sphere can restrain as many as four Medium or smaller creatures or one Large creature. If the sphere restrains a creature that causes it to exceed this capacity, a random creature that was already restrained by the sphere falls out of it and lands prone in a space within 5 feet of it.\n\nAs an action, you can move the sphere up to 30 feet in a straight line. If it moves over a pit, a cliff, or other drop-off, it safely descends until it is hovering 10 feet above the ground. Any creature restrained by the sphere moves with it. You can ram the sphere into creatures, forcing them to make the saving throw.\n\nWhen the spell ends, the sphere falls to the ground and extinguishes all normal flames within 30 feet of it. Any creature restrained by the sphere is knocked prone in the space where it falls. The water then vanishes.","components":"V, S, M *","duration":"Concentration 1 Minute","range":"90 ft (5 ft)","roll":null,"url":"https://www.dndbeyond.com/spells/watery-sphere"},"Black Tentacles":{"name":"Black Tentacles","level":"4th","ctime":"1 Action","ritual":"no","concentration":"no","school":"Conjuration","description":"Squirming, ebony tentacles fill a 20-foot square on ground that you can see within range. For the duration, these tentacles turn the ground in the area into difficult terrain.\n\nWhen a creature enters the affected area for the first time on a turn or starts its turn there, the creature must succeed on a Dexterity saving throw or take 3d6 bludgeoning damage and be restrained by the tentacles until the spell ends. A creature that starts its turn in the area and is already restrained by the tentacles takes 3d6 bludgeoning damage.\n\nA creature restrained by the tentacles can use its action to make a Strength or Dexterity check (its choice) against your spell save DC. On a success, it frees itself.","components":"V, S, M *","duration":"Concentration 1 Minute","range":"90 ft","roll":"3d6","url":"https://www.dndbeyond.com/spells/black-tentacles"},"Polymorph":{"name":"Polymorph","level":"4th","ctime":"1 Action","ritual":"no","concentration":"no","school":"Transmutation","description":"This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a Wisdom saving throw to avoid the effect. The spell has no effect on a shapechanger or a creature with 0 hit points.\n\nThe transformation lasts for the duration, or until the target drops to 0 hit points or dies. The new form can be any beast whose challenge rating is equal to or less than the target's (or the target's level, if it doesn't have a challenge rating). The target's game statistics, including mental ability scores, are replaced by the statistics of the chosen beast. It retains its alignment and personality.\n\nThe target assumes the hit points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious.\n\nThe creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech.\n\nThe target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.","components":"V, S, M *","duration":"Concentration 1 Hour","range":"60 ft","roll":null,"url":"https://www.dndbeyond.com/spells/polymorph"},"Dimension Door":{"name":"Dimension Door","level":"4th","ctime":"1 Action","ritual":"no","concentration":"no","school":"Conjuration","description":"You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"upward to the northwest at a 45- degree angle, 300 feet.\n\n\"You can bring along objects as long as their weight doesn't exceed what you can carry. You can also bring one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell.\n\nIf you would arrive in a place already occupied by an object or a creature, you and any creature traveling with you each take 4d6 force damage, and the spell fails to teleport you.","components":"V","duration":"Instantaneous","range":"500 ft","roll":"4d6","url":"https://www.dndbeyond.com/spells/dimension-door"},"Arcane Hand":{"name":"Arcane Hand","level":"5th","ctime":"1 Action","ritual":"no","concentration":"no","school":"Evocation","description":"You create a Large hand of shimmering, translucent force in an unoccupied space that you can see within range. The hand lasts for the spell's duration, and it moves at your command, mimicking the movements of your own hand.\n\nThe hand is an object that has AC 20 and hit points equal to your hit point maximum. If it drops to 0 hit points, the spell ends. It has a Strength of 26 (+8) and a Dexterity of 10 (+0). The hand doesn't fill its space. When you cast the spell and as a bonus action on your subsequent turns, you can move the hand up to 60 feet and then cause one of the following effects with it.\n\nClenched Fist. The hand strikes one creature or object within 5 feet of it. Make a melee spell attack for the hand using your game statistics. On a hit, the target takes 4d8 force damage.\n\nForceful Hand. The hand attempts to push a creature within 5 feet of it in a direction you choose. Make a check with the hand's Strength contested by the Strength (Athletics) check of the target. If the target is Medium or smaller, you have advantage on the check. If you succeed, the hand pushes the target up to 5 feet plus a number of feet equal to five times your spellcasting ability modifier. The hand moves with the target to remain within 5 feet of it.\n\nGrasping Hand. The hand attempts to grapple a Huge or smaller creature within 5 feet of it. You use the hand's Strength score to resolve the grapple. If the target is Medium or smaller, you have advantage on the check. While the hand is grappling the target, you can use a bonus action to have the hand crush it. When you do so, the target takes bludgeoning damage equal to 2d6 + your spellcasting ability modifier.\n\nInterposing Hand. The hand interposes itself between you and a creature you choose until you give the hand a different command. The hand moves to stay between you and the target, providing you with half cover against the target. The target can't move through the hand's space if its Strength score is less than or equal to the hand's Strength score. If its Strength score is higher than the hand's Strength score, the target can move toward you through the hand's space, but that space is difficult terrain for the target.\n\nAt Higher Levels. When you cast this spell using a spell slot of 6th level or higher, the damage from the clenched fist option increases by 2d8 and the damage from the grasping hand increases by 2d6 for each slot level above 5th.","components":"V, S, M *","duration":"Concentration 1 Minute","range":"120 ft","roll":"4d8","url":"https://www.dndbeyond.com/spells/arcane-hand"},"Wall of Force":{"name":"Wall of Force","level":"5th","ctime":"1 Action","ritual":"no","concentration":"no","school":"Evocation","description":"An invisible wall of force springs into existence at a point you choose within range. The wall appears in any orientation you choose, as a horizontal or vertical barrier or at an angle. It can be free floating or resting on a solid surface. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-by-10-foot panels. Each panel must be contiguous with another panel. In any form, the wall is 1/4 inch thick. It lasts for the duration. If the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (your choice which side).\n\nNothing can physically pass through the wall. It is immune to all damage and can't be dispelled by dispel magic. A disintegrate spell destroys the wall instantly, however. The wall also extends into the Ethereal Plane, blocking ethereal travel through the wall.","components":"V, S, M *","duration":"Concentration 10 Minutes","range":"120 ft","roll":null,"url":"https://www.dndbeyond.com/spells/wall-of-force"},"Teleportation Circle":{"name":"Teleportation Circle","level":"5th","ctime":"1 Minute","ritual":"no","concentration":"no","school":"Conjuration","description":"As you cast the spell, you draw a 10-foot-diameter circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you know and that is on the same plane of existence as you. A shimmering portal opens within the circle you drew and remains open until the end of your next turn. Any creature that enters the portal instantly appears within 5 feet of the destination circle or in the nearest unoccupied space if that space is occupied.\n\nMany major temples, guilds, and other important places have permanent teleportation circles inscribed somewhere within their confines. Each such circle includes a unique sigil sequence--a string of magical runes arranged in a particular pattern. When you first gain the ability to cast this spell, you learn the sigil sequences for two destinations on the Material Plane, determined by the GM. You can learn additional sigil sequences during your adventures. You can commit a new sigil sequence to memory after studying it for 1 minute.\n\nYou can create a permanent teleportation circle by casting this spell in the same location every day for one year. You need not use the circle to teleport when you cast the spell in this way.","components":"V, M *","duration":"1 Round","range":"10 ft","roll":null,"url":"https://www.dndbeyond.com/spells/teleportation-circle"}},"spcMod":"int","preparedSpells":["Mage Armor","Magic Missle","Shield","Flaming Sphere","Misty Step","Fireball","Counterspell","Fly","Remove Curse","Polymorph","Dimension Door","Watery Sphere","Black Tentacles","Arcane Hand","Wall of Force"]},"invData":{"gold":551,"backpack":{"Pouch":{"name":"Pouch","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Staff":{"name":"Staff","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Clothes":{"name":"Clothes","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Small Knife":{"name":"Small Knife","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Book":{"name":"Book","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Incense":{"name":"Incense","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":0,"properties":[],"singleUse":true,"qnty":5},"Vestements":{"name":"Vestements","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Ink Pen":{"name":"Ink Pen","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Bag of Sand":{"name":"Bag of Sand","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Parchment":{"name":"Parchment","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":0,"properties":[],"singleUse":false,"qnty":10},"Backpack":{"name":"Backpack","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Book of Lore":{"name":"Book of Lore","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Strange Spellbook":{"name":"Strange Spellbook","cost":0,"dmgType":"","desc":"Obtained from midnight tower","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Spellbook":{"name":"Spellbook","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Ink":{"name":"Ink","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Bedroll":{"name":"Bedroll","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Rations":{"name":"Rations","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":true,"qnty":3},"Pot of Tea":{"name":"Pot of Tea","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Dagger":{"name":"Dagger","cost":0,"dmgType":"","desc":"Small sharp dagger","range":10,"dmg":"1d4","weight":1,"properties":[],"singleUse":false,"qnty":1},"Vial of Holding":{"name":"Vial of Holding","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Druid Staff":{"name":"Druid Staff","cost":0,"dmgType":"","desc":"Select and use one level 0 or 1 Druid Spell a Day","range":10,"dmg":"","weight":1,"properties":[],"singleUse":false,"qnty":1},"Darkvision Potion":{"name":"Darkvision Potion","cost":0,"dmgType":"","desc":"No description exists for this item","range":10,"dmg":"","weight":1,"properties":[],"singleUse":true,"qnty":2}}},"renderData":{"avatar":"http://i.imgur.com/BoC7C8a.png"}}